
### :robot: Terraform Report
---
##### Plan: `18` to add, `0` to change, `12` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_iam_member.python_nb_sa_project_access["roles/datastore.user"] will be destroyed
  # (because google_project_iam_member.python_nb_sa_project_access is not in configuration)
  - resource "google_project_iam_member" "python_nb_sa_project_access" {
      - etag    = "BwYoizvoKZQ=" -> null
      - id      = "maestro-intelligence/roles/datastore.user/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - project = "maestro-intelligence" -> null
      - role    = "roles/datastore.user" -> null
    }

  # google_project_iam_member.python_nb_sa_project_access["roles/secretmanager.secretAccessor"] will be destroyed
  # (because google_project_iam_member.python_nb_sa_project_access is not in configuration)
  - resource "google_project_iam_member" "python_nb_sa_project_access" {
      - etag    = "BwYoizvoKZQ=" -> null
      - id      = "maestro-intelligence/roles/secretmanager.secretAccessor/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - project = "maestro-intelligence" -> null
      - role    = "roles/secretmanager.secretAccessor" -> null
    }

  # google_project_iam_member.python_nb_sa_project_access["roles/storage.objectUser"] will be destroyed
  # (because google_project_iam_member.python_nb_sa_project_access is not in configuration)
  - resource "google_project_iam_member" "python_nb_sa_project_access" {
      - etag    = "BwYoizvoKZQ=" -> null
      - id      = "maestro-intelligence/roles/storage.objectUser/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - project = "maestro-intelligence" -> null
      - role    = "roles/storage.objectUser" -> null
    }

  # google_project_iam_member.python_nb_sa_project_access["roles/storage.objectViewer"] will be destroyed
  # (because google_project_iam_member.python_nb_sa_project_access is not in configuration)
  - resource "google_project_iam_member" "python_nb_sa_project_access" {
      - etag    = "BwYoizvoKZQ=" -> null
      - id      = "maestro-intelligence/roles/storage.objectViewer/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - project = "maestro-intelligence" -> null
      - role    = "roles/storage.objectViewer" -> null
    }

  # google_project_iam_member.python_sa_project_access["roles/datastore.user"] will be created
  + resource "google_project_iam_member" "python_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/datastore.user"
    }

  # google_project_iam_member.python_sa_project_access["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "python_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.python_sa_project_access["roles/storage.objectUser"] will be created
  + resource "google_project_iam_member" "python_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectUser"
    }

  # google_project_iam_member.python_sa_project_access["roles/storage.objectViewer"] will be created
  + resource "google_project_iam_member" "python_sa_project_access" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "maestro-intelligence"
      + role    = "roles/storage.objectViewer"
    }

  # google_service_account.python_nb_sa will be destroyed
  # (because google_service_account.python_nb_sa is not in configuration)
  - resource "google_service_account" "python_nb_sa" {
      - account_id   = "python-nb-sa" -> null
      - disabled     = false -> null
      - display_name = "Service Account for python notebooks" -> null
      - email        = "python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - id           = "projects/maestro-intelligence/serviceAccounts/python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - name         = "projects/maestro-intelligence/serviceAccounts/python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - project      = "maestro-intelligence" -> null
      - unique_id    = "108736422830601569464" -> null
        # (1 unchanged attribute hidden)
    }

  # google_service_account.python_sa will be created
  + resource "google_service_account" "python_sa" {
      + account_id   = "python-sa"
      + disabled     = false
      + display_name = "Service Account for python server"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "maestro-intelligence"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.backend_admin["roles/iam.serviceAccountTokenCreator"] must be replaced
-/+ resource "google_service_account_iam_member" "backend_admin" {
      ~ etag               = "BwYoigsXmGg=" -> (known after apply)
      ~ id                 = "projects/maestro-intelligence/serviceAccounts/maestro-backend@maestro-intelligence.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> (known after apply)
      ~ member             = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_service_account_iam_member.backend_admin["roles/iam.serviceAccountUser"] must be replaced
-/+ resource "google_service_account_iam_member" "backend_admin" {
      ~ etag               = "BwYoigsXmGg=" -> (known after apply)
      ~ id                 = "projects/maestro-intelligence/serviceAccounts/maestro-backend@maestro-intelligence.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> (known after apply)
      ~ member             = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_service_account_iam_member.python_nb_sa_self["roles/iam.serviceAccountTokenCreator"] will be destroyed
  # (because google_service_account_iam_member.python_nb_sa_self is not in configuration)
  - resource "google_service_account_iam_member" "python_nb_sa_self" {
      - etag               = "BwYoigsYLPg=" -> null
      - id                 = "projects/maestro-intelligence/serviceAccounts/python-nb-sa@maestro-intelligence.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member             = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - role               = "roles/iam.serviceAccountTokenCreator" -> null
      - service_account_id = "projects/maestro-intelligence/serviceAccounts/python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
    }

  # google_service_account_iam_member.python_nb_sa_self["roles/iam.serviceAccountUser"] will be destroyed
  # (because google_service_account_iam_member.python_nb_sa_self is not in configuration)
  - resource "google_service_account_iam_member" "python_nb_sa_self" {
      - etag               = "BwYoigsYLPg=" -> null
      - id                 = "projects/maestro-intelligence/serviceAccounts/python-nb-sa@maestro-intelligence.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member             = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - role               = "roles/iam.serviceAccountUser" -> null
      - service_account_id = "projects/maestro-intelligence/serviceAccounts/python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
    }

  # google_service_account_iam_member.python_sa_group["user:amilcar.infante@globant.com"] will be created
  + resource "google_service_account_iam_member" "python_sa_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:amilcar.infante@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.python_sa_group["user:federico.acien@globant.com"] will be created
  + resource "google_service_account_iam_member" "python_sa_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:federico.acien@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.python_sa_group["user:felipe.bozzano@globant.com"] will be created
  + resource "google_service_account_iam_member" "python_sa_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:felipe.bozzano@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.python_sa_group["user:julioisrael.gonzalez@globant.com"] will be created
  + resource "google_service_account_iam_member" "python_sa_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:julioisrael.gonzalez@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.python_sa_group["user:manuel.aller@globant.com"] will be created
  + resource "google_service_account_iam_member" "python_sa_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:manuel.aller@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.python_sa_group["user:miguel.murillo@globant.com"] will be created
  + resource "google_service_account_iam_member" "python_sa_group" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "user:miguel.murillo@globant.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.python_sa_self["roles/iam.serviceAccountTokenCreator"] will be created
  + resource "google_service_account_iam_member" "python_sa_self" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.python_sa_self["roles/iam.serviceAccountUser"] will be created
  + resource "google_service_account_iam_member" "python_sa_self" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket_iam_member.python_nb_sa_access["roles/storage.admin"] will be destroyed
  # (because google_storage_bucket_iam_member.python_nb_sa_access is not in configuration)
  - resource "google_storage_bucket_iam_member" "python_nb_sa_access" {
      - bucket = "b/maestro_backend_overlays" -> null
      - etag   = "CAY=" -> null
      - id     = "b/maestro_backend_overlays/roles/storage.admin/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.admin" -> null
    }

  # google_storage_bucket_iam_member.python_nb_sa_access["roles/storage.objectUser"] will be destroyed
  # (because google_storage_bucket_iam_member.python_nb_sa_access is not in configuration)
  - resource "google_storage_bucket_iam_member" "python_nb_sa_access" {
      - bucket = "b/maestro_backend_overlays" -> null
      - etag   = "CAY=" -> null
      - id     = "b/maestro_backend_overlays/roles/storage.objectUser/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectUser" -> null
    }

  # google_storage_bucket_iam_member.python_nb_sa_access["roles/storage.objectViewer"] will be destroyed
  # (because google_storage_bucket_iam_member.python_nb_sa_access is not in configuration)
  - resource "google_storage_bucket_iam_member" "python_nb_sa_access" {
      - bucket = "b/maestro_backend_overlays" -> null
      - etag   = "CAY=" -> null
      - id     = "b/maestro_backend_overlays/roles/storage.objectViewer/serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:python-nb-sa@maestro-intelligence.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # google_storage_bucket_iam_member.python_sa_access["roles/storage.admin"] will be created
  + resource "google_storage_bucket_iam_member" "python_sa_access" {
      + bucket = "maestro_backend_overlays"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # google_storage_bucket_iam_member.python_sa_access["roles/storage.objectUser"] will be created
  + resource "google_storage_bucket_iam_member" "python_sa_access" {
      + bucket = "maestro_backend_overlays"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectUser"
    }

  # google_storage_bucket_iam_member.python_sa_access["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_member" "python_sa_access" {
      + bucket = "maestro_backend_overlays"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

Plan: 18 to add, 0 to change, 12 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12240709392`](https://github.com/lessthan3/personalization/actions/runs/12240709392) - commit 9da1a6d1f6f498b4ef0cef3862a27d700ee8b38f
